# У цьому файлі міститься скрипт гри.

# Оголошення символів, які використовуються в цій грі. Колірний аргумент розфарбовує
# ім'я персонажа.

define ruby = Character("Рубі")


# Гра починається тут.

label start:

    # Це показує фон. За замовчуванням використовується заповнювач, але ви можете
    # додати файл (з назвою "bg room.png" або "bg room.jpg") до
    # каталогу images, щоб показати його.

    scene bg room

    # Це показує спрайт персонажа. Використовується заповнювач, але ви можете
    # замінити його, додавши до зображень файл із назвою "eileen happy.png".
    # до каталогу.

    show ruby happy

    # Це репліки діалогу.

    ruby "Привіт! Рада тебе вітати тут!"

    ruby "Я – Рубі, а тебе як звати?"

    # На цьому гра закінчується.

    return
