define pc = Character("Комп’ютер")
define form = Character("Форма")

define girl = Character("Дівчина")
define boy = Character("Хлопець")

define main = Character("Ви")
define cpp = Character("Сі")

label start:
    scene bg pc

    pc "Вам надійшов лист: \"Добрий день, шановний абітурієнт. Раді повідомити Вам, що по результатам конкурсу Ви пройшли на бюджет до найкращого університету ЧНУ ім. П. Могили!..."
    pc "... Щоб продовжити процедуру вступу, пройдіть, будь ласка, за посиланням для детальної інформації щодо необхідних документів та часів роботи приймальної комісії\"."

    menu:
        "Прийняти запрошення на вступ?"

        "Так":
            "Ви переходите за посиланням. Після вивчення усієї інформації на сторінці, Ви переходити на форму для онлайн-запису до приймальної комісії."

            python:
                main_name = renpy.input("Ваше ім'я:")

            menu:
                form "Ваша стать:"

                "Жінка":
                    python:
                        main_gender = 0

                "Чоловік":
                    python:
                        main_gender = 1

                "Не вказано":
                    python:
                        main_gender = 2

            "Після заповнення ще деякої інформації..."

            form "Дякуємо, [main_name], що вирішили вступити до найкращого університету ЧНУ ім. П. Могили! З нетерпінням чекаємо Вас в наших стінах."

            jump intro_ruby

        "Ні":
            #TODO: bad ending :(
            
            return


label intro_ruby:
    jump intro_cpp


label intro_cpp:
    scene black #TODO: add bg

    "Під кінець спекотного літа університет, в який Ви успішно поступили, проводить збір майбутніх студентів для ознайомлення з новим навчальним закладом та одногрупниками."
    "Вставши після дзвінка будильника, Ви збираєтесь на зустріч новим подіям та знайомствам."

    pause 2

    "І ось Ви тут знову. Ви відчуваєте піднесення і деякий страх перед новою сторінкою Вашого життя. Скоро цей новий вхід до будівлі університету стане для Вас буденним."

    "Прямо перед Вашими очима стоїть стенд, на якому ще до початку навчального року вже висять об’яви. Ви зацікавлено підхидите."

    "Брошури для абітурієнтів, запрошення на курси англійської мови, телефони психологічної підтримки…"

    "Вас зацікавив плакат, на якому Ви бачите сьогоднішню дату. Великими буквами написано “Благодійний ярмарок”."

    if main_gender == 0:
        girl "Зацікавилась сьогоднішнім ярмарком?"
    elif main_gender == 1:
        girl "Зацікавився сьогоднішнім ярмарком?"
    elif main_gender == 2:
        girl "Зацікавились сьогоднішнім ярмарком?"
    
    "Несподівано Ви почули голос біля Вас. Повернувшись у напрямку, звідки він був, Ви побачили миловидну дівчину."

    show cpp happy

    girl "В навчальні дні у студентів не так багато часу читати якісь плакати на вході, тому вирішили почати ярмарок саме сьогодні."

    if main_gender == 0:
        girl "Ти ж першокурсниця, так?"
    elif main_gender == 1 or main_gender == 2:
        girl "Ти ж першокурсник, так?"

    "Ви киваєте головою, дивлячись на дівчину зі здивуванням."

    cpp "Вибач, зовсім забула представитись. Мене звуть Сі. Навчаюсь на другому курсі."

    main "Мене [main_name]. Приємно познайомитись…"

    cpp "На ярмарку ми продаємо різні поробки, зроблені дітками з дитячого будинку. Всі кошти підуть на купівлю нової одежі та іграшок для них."
    cpp "Ти дуже допоможеш, якщо щось купиш."
    cpp "Чи не хочеш подивитись на поробки? Тут не далеко, пару кроків і ось за тими дверима стоять стенди."

    "Схоже, Сі і правда дуже горить цим ділом, адже так швидко говорити ще й не запинатись не кожен репер може."

    menu: 
        "Піти з Сі?"

        "Так":
            main "В мене ще є час, тому чому б ні. Ось ті двері?"

            cpp "Так-так, пішли, я тебе проведу. Ти точно не пожалкуєш."
        
        "Ні":
            main "Вибач, але я не дуже зацікавлений в такого роду подіях."
            
            show cpp sad

            cpp "А-але так ти зможеш допомогти діткам.. Давай ти хоча б подивишся, м-можеш нічого не купувати."

    hide cpp happy

    "Ви разом з Сі заходите до кабінету, в якому на столах розставлені різні дитячі поробки. Янголятка, ляльки-мотанки, дома з картону та.."
    "Новорічна ялинка з паперу."
    "Ви точно не очікували побачити в кінці літа щось зимове, але це підняло Вам настрій." 
    "Ви вирішили купити як сувенір цю маленьку поробку, яка не вписувалась в навколишні обстановку, але тим і привернула Вашу увагу."

    show cpp happy

    cpp "Хіхі"
    cpp "А ой, вибач, я не з тебе сміялася."
    cpp "Просто не думала, що хтось в кінці літа вирішить її купити."
    cpp "Дякую тобі велике! Скоро почнеться посвята, тому не буду більше тебе затримувати. Бережи себе!"

    "Ви навіть не помітили, як швидко минув час за розгляданням поробок. Попрощавшись, Ви, дотримуючись вказівників, піднімаєтесь по сходам та заходите в актову залу."

    scene bg hall # TODO: find a new one (with people)

    "Здається, Ви встигнули. На перших сидіннях кожного ряду написано номер групи. Знайшовши свій, Ви просуваєтесь далі по ряду і сідаєте біля Ваших нових одногрупників."
    "Не довго чекаючи, на сцену вийшла дівчина і всі затихли. Так почалась посвята у студенти. Вас привітали зі вступом до університету, розповіли про традиції та щорічні заходи."
    "Вас познайомили з керуючими органами Вашого факультету, представили кураторів усіх груп, в тому числі і Вашої. Ви взнали про навчальну платформу, на якій Ви будете вчитися, розклад на семестр, як проходитиме сесія і всі інші початкові знання, необхідні першокурсникам."
    "В кінці декан провела мотиваційний виступ і посвятила Вас в студенти університету."
    "Після оплесків, всі почали швидко виходити з актової зали, тому Ви слідуєте за натовпом в сторону виходу."

    return